function week(){
    //let array = ['Понедельник', 'Вторник', 'среда', 'четверг', 'пятница']
    //let rand = Math.floor(Math.random()*array.length);
    //let rValue = array[rand];
    //let day = prompt('Какой сегодня день, работяга?', rValue); //Просим пользователя ввести день недели со случайной подсказкой.
    var days = [
        'Воскресенье',
        'Понедельник',
        'Вторник',
        'Среда',
        'Четверг',
        'Пятница',
        'Суббота'];
    var d = new Date();
    var n = d.getDay();
    console.log(days[n]);
    let day = prompt('Какой сегодня день, работяга?', days[n]); //Просим пользователя ввести день недели с подсказкой
    switch(day){
        case ('Понедельник'):
            alert('Понедельник - день тяжёлый!');
            alert('Дней до выходных осталось: 5');
            break;
        case ('Вторник'):
            alert('Сегодня - вторник');
            alert('Дней до выходных осталось: 4');
            break;
        case ('Среда'):
            alert('Сегодня - среда');
            alert('Дней до выходных осталось: 3');
            break;
        case ('Четверг'):
            alert('Сегодня - четверг, до выходных осталось совсем немного!');
            alert('Дней до выходных осталось: 2');
            break;
        case ('Пятница'):
            alert('Ура! Пятница!');
            alert('Дней до выходных осталось: 1');
            break;
        case ('Суббота'):
            alert('Суббота - выходной!');
            break;
        case ('Воскресенье'):
            alert('Воскресенье - выходной!');
            break;
         //А теперь тоже самое, но если пользователь введёт номер дня, а не слово.
        case ('1'):
            alert('Понедельник - день тяжёлый!');
            alert('Дней до выходных осталось: 5');
            break;
        case ('2'):
            alert('Сегодня - Вторник');
            alert('Дней до выходных осталось: 4');
            break;
        case ('3'):
            alert('Сегодня - среда');
            alert('Дней до выходных осталось: 3');
            break;
        case ('4'):
            alert('Сегодня - четверг, до выходных осталось совсем немного!');
            alert('Дней до выходных осталось: 2');
            break;
        case ('5'):
            alert('Ура! Пятница!');
            alert('Дней до выходных осталось: 1');
            break;
        case ('6'):
            alert('Суббота - выходной!');
            break;
        case ('7'):
            alert('Воскресенье - выходной!');
            break;
        
    }
}
